# Concatination of DataFrames

Concatination is not same as merging, merging is different.

In [6]:
import pandas as pd

In [8]:
df1 = pd.DataFrame({
    "Name" : ["Shyam","Sundar","Saurav","Aparna"],
    "Marks" : [100,99,98,95]
})

In [10]:
df1

     Name  Marks
0   Shyam    100
1  Sundar     99
2  Saurav     98
3  Aparna     95

In [12]:
df2 = pd.DataFrame({
    "Name" : ["Shalini","Mundar","Haura","Prerona"],
    "Marks" : [1,59,68,55]
})

In [14]:
df2

      Name  Marks
0  Shalini      1
1   Mundar     59
2    Haura     68
3  Prerona     55

In [16]:
df3 = pd.concat([df1,df2])

In [18]:
df3

      Name  Marks
0    Shyam    100
1   Sundar     99
2   Saurav     98
3   Aparna     95
0  Shalini      1
1   Mundar     59
2    Haura     68
3  Prerona     55

# Merging of DataFrame

In [21]:
df1 = pd.DataFrame({
    "Name" : ["Shyam","Sundar","Saurav","Aparna"],
    "Marks" : [100,99,98,95]
})

In [23]:
df2 = pd.DataFrame({
    "Name" : ["Shyam","Sundar","Saurav","Aparna"],
    "Roll" : [14,15,16,17]
})

In [25]:
df3 = pd.merge(df1,df2,on="Name")

In [27]:
df3

     Name  Marks  Roll
0   Shyam    100    14
1  Sundar     99    15
2  Saurav     98    16
3  Aparna     95    17

In [33]:
df3.to_csv("E:\\Jupyter_ML\\Pandas_Crash_Course\\crash.csv", index = False)        #This is how we can create a CSV or Excel File.